SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_lesense.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG23 LESENSE register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG23_LESENSE_H
#define EFR32SG23_LESENSE_H

#define LESENSE_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG23_LESENSE LESENSE
 * @{
 * @brief EFR32SG23 LESENSE Register Declaration.
 *****************************************************************************/

/** LESENSE CH Register Group Declaration. */
typedef struct
{
  __IOM uint32_t             TIMING;                 /**< Scan configuration                                 */
  __IOM uint32_t             INTERACT;               /**< Scan configuration                                 */
  __IOM uint32_t             EVALCFG;                /**< Scan configuration                                 */
  __IOM uint32_t             EVALTHRES;              /**< Scan confguration                                  */
} LESENSE_CH_TypeDef;


/** LESENSE ST Register Group Declaration. */
typedef struct
{
  __IOM uint32_t             ARC;                    /**< State transition Arc                               */
} LESENSE_ST_TypeDef;


/** LESENSE Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IPVERSION                                          */
  __IOM uint32_t             EN;                     /**< Enable                                             */
  __IOM uint32_t             SWRST;                  /**< Software Reset Register                            */
  __IOM uint32_t             CFG;                    /**< Configuration                                      */
  __IOM uint32_t             TIMCTRL;                /**< Timing Control                                     */
  __IOM uint32_t             PERCTRL;                /**< Peripheral Control                                 */
  __IOM uint32_t             DECCTRL;                /**< Decoder control                                    */
  __IOM uint32_t             EVALCTRL;               /**< LESENSE evaluation                                 */
  __IOM uint32_t             PRSCTRL;                /**< PRS control                                        */
  __IOM uint32_t             CMD;                    /**< Command                                            */
  __IOM uint32_t             CHEN;                   /**< Channel enable                                     */
  __IM  uint32_t             SCANRES;                /**< Scan result                                        */
  __IM  uint32_t             STATUS;                 /**< Status                                             */
  __IM  uint32_t             RESCOUNT;               /**< Result FIFO Count                                  */
  __IM  uint32_t             RESFIFO;                /**< Result Fifo                                        */
  __IM  uint32_t             CURCH;                  /**< Current channel index                              */
  __IM  uint32_t             DECSTATE;               /**< Current decoder state                              */
  __IM  uint32_t             SENSORSTATE;            /**< Sensor State                                       */
  __IOM uint32_t             IDLECONF;               /**< IDLE Configuration                                 */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             SYNCBUSY;               /**< Synchronization                                    */
        uint32_t             RESERVED1[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             IF;                     /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN;                    /**< Interrupt Enables                                  */
        uint32_t             RESERVED2[38U];    /**< Reserved for future use                            */
        LESENSE_CH_TypeDef   CH[16U];           /**< Channels                                           */
        LESENSE_ST_TypeDef   ST[64U];           /**< Decoding FSM Arcs                                  */
        uint32_t             RESERVED3[832U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_SET;                 /**< Enable                                             */
  __IOM uint32_t             SWRST_SET;              /**< Software Reset Register                            */
  __IOM uint32_t             CFG_SET;                /**< Configuration                                      */
  __IOM uint32_t             TIMCTRL_SET;            /**< Timing Control                                     */
  __IOM uint32_t             PERCTRL_SET;            /**< Peripheral Control                                 */
  __IOM uint32_t             DECCTRL_SET;            /**< Decoder control                                    */
  __IOM uint32_t             EVALCTRL_SET;           /**< LESENSE evaluation                                 */
  __IOM uint32_t             PRSCTRL_SET;            /**< PRS control                                        */
  __IOM uint32_t             CMD_SET;                /**< Command                                            */
  __IOM uint32_t             CHEN_SET;               /**< Channel enable                                     */
  __IM  uint32_t             SCANRES_SET;            /**< Scan result                                        */
  __IM  uint32_t             STATUS_SET;             /**< Status                                             */
  __IM  uint32_t             RESCOUNT_SET;           /**< Result FIFO Count                                  */
  __IM  uint32_t             RESFIFO_SET;            /**< Result Fifo                                        */
  __IM  uint32_t             CURCH_SET;              /**< Current channel index                              */
  __IM  uint32_t             DECSTATE_SET;           /**< Current decoder state                              */
  __IM  uint32_t             SENSORSTATE_SET;        /**< Sensor State                                       */
  __IOM uint32_t             IDLECONF_SET;           /**< IDLE Configuration                                 */
        uint32_t             RESERVED4[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             SYNCBUSY_SET;           /**< Synchronization                                    */
        uint32_t             RESERVED5[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enables                                  */
        uint32_t             RESERVED6[38U];    /**< Reserved for future use                            */
        LESENSE_CH_TypeDef   CH_SET[16U];       /**< Channels                                           */
        LESENSE_ST_TypeDef   ST_SET[64U];       /**< Decoding FSM Arcs                                  */
        uint32_t             RESERVED7[832U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_CLR;                 /**< Enable                                             */
  __IOM uint32_t             SWRST_CLR;              /**< Software Reset Register                            */
  __IOM uint32_t             CFG_CLR;                /**< Configuration                                      */
  __IOM uint32_t             TIMCTRL_CLR;            /**< Timing Control                                     */
  __IOM uint32_t             PERCTRL_CLR;            /**< Peripheral Control                                 */
  __IOM uint32_t             DECCTRL_CLR;            /**< Decoder control                                    */
  __IOM uint32_t             EVALCTRL_CLR;           /**< LESENSE evaluation                                 */
  __IOM uint32_t             PRSCTRL_CLR;            /**< PRS control                                        */
  __IOM uint32_t             CMD_CLR;                /**< Command                                            */
  __IOM uint32_t             CHEN_CLR;               /**< Channel enable                                     */
  __IM  uint32_t             SCANRES_CLR;            /**< Scan result                                        */
  __IM  uint32_t             STATUS_CLR;             /**< Status                                             */
  __IM  uint32_t             RESCOUNT_CLR;           /**< Result FIFO Count                                  */
  __IM  uint32_t             RESFIFO_CLR;            /**< Result Fifo                                        */
  __IM  uint32_t             CURCH_CLR;              /**< Current channel index                              */
  __IM  uint32_t             DECSTATE_CLR;           /**< Current decoder state                              */
  __IM  uint32_t             SENSORSTATE_CLR;        /**< Sensor State                                       */
  __IOM uint32_t             IDLECONF_CLR;           /**< IDLE Configuration                                 */
        uint32_t             RESERVED8[1U];          /**< Reserved for future use                            */
  __IM  uint32_t             SYNCBUSY_CLR;           /**< Synchronization                                    */
        uint32_t             RESERVED9[3U];          /**< Reserved for future use                            */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enables                                  */
        uint32_t             RESERVED10[38U];   /**< Reserved for future use                            */
        LESENSE_CH_TypeDef   CH_CLR[16U];       /**< Channels                                           */
        LESENSE_ST_TypeDef   ST_CLR[64U];       /**< Decoding FSM Arcs                                  */
        uint32_t             RESERVED11[832U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_TGL;                 /**< Enable                                             */
  __IOM uint32_t             SWRST_TGL;              /**< Software Reset Register                            */
  __IOM uint32_t             CFG_TGL;                /**< Configuration                                      */
  __IOM uint32_t             TIMCTRL_TGL;            /**< Timing Control                                     */
  __IOM uint32_t             PERCTRL_TGL;            /**< Peripheral Control                                 */
  __IOM uint32_t             DECCTRL_TGL;            /**< Decoder control                                    */
  __IOM uint32_t             EVALCTRL_TGL;           /**< LESENSE evaluation                                 */
  __IOM uint32_t             PRSCTRL_TGL;            /**< PRS control                                        */
  __IOM uint32_t             CMD_TGL;                /**< Command                                            */
  __IOM uint32_t             CHEN_TGL;               /**< Channel enable                                     */
  __IM  uint32_t             SCANRES_TGL;            /**< Scan result                                        */
  __IM  uint32_t             STATUS_TGL;             /**< Status                                             */
  __IM  uint32_t             RESCOUNT_TGL;           /**< Result FIFO Count                                  */
  __IM  uint32_t             RESFIFO_TGL;            /**< Result Fifo                                        */
  __IM  uint32_t             CURCH_TGL;              /**< Current channel index                              */
  __IM  uint32_t             DECSTATE_TGL;           /**< Current decoder state                              */
  __IM  uint32_t             SENSORSTATE_TGL;        /**< Sensor State                                       */
  __IOM uint32_t             IDLECONF_TGL;           /**< IDLE Configuration                                 */
        uint32_t             RESERVED12[1U];         /**< Reserved for future use                            */
  __IM  uint32_t             SYNCBUSY_TGL;           /**< Synchronization                                    */
        uint32_t             RESERVED13[3U];         /**< Reserved for future use                            */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enables                                  */
        uint32_t             RESERVED14[38U];   /**< Reserved for future use                            */
        LESENSE_CH_TypeDef   CH_TGL[16U];       /**< Channels                                           */
        LESENSE_ST_TypeDef   ST_TGL[64U];       /**< Decoding FSM Arcs                                  */
} LESENSE_TypeDef;
