SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_lesense.h
/** @} End of group EFR32SG23_LESENSE */

/**************************************************************************//**
 * @addtogroup EFR32SG23_LESENSE
 * @{
 * @defgroup EFR32SG23_LESENSE_BitFields LESENSE Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for LESENSE IPVERSION */
#define _LESENSE_IPVERSION_RESETVALUE           0x00000001UL                            /**< Default value for LESENSE_IPVERSION         */
#define _LESENSE_IPVERSION_MASK                 0xFFFFFFFFUL                            /**< Mask for LESENSE_IPVERSION                  */
#define _LESENSE_IPVERSION_IPVERSION_SHIFT      0                                       /**< Shift value for LESENSE_IPVERSION           */
#define _LESENSE_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                            /**< Bit mask for LESENSE_IPVERSION              */
#define _LESENSE_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                            /**< Mode DEFAULT for LESENSE_IPVERSION          */
#define LESENSE_IPVERSION_IPVERSION_DEFAULT     (_LESENSE_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_IPVERSION  */

/* Bit fields for LESENSE EN */
#define _LESENSE_EN_RESETVALUE                  0x00000000UL                            /**< Default value for LESENSE_EN                */
#define _LESENSE_EN_MASK                        0x00000003UL                            /**< Mask for LESENSE_EN                         */
#define LESENSE_EN_EN                           (0x1UL << 0)                            /**< Enable                                      */
#define _LESENSE_EN_EN_SHIFT                    0                                       /**< Shift value for LESENSE_EN                  */
#define _LESENSE_EN_EN_MASK                     0x1UL                                   /**< Bit mask for LESENSE_EN                     */
#define _LESENSE_EN_EN_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for LESENSE_EN                 */
#define _LESENSE_EN_EN_DISABLE                  0x00000000UL                            /**< Mode DISABLE for LESENSE_EN                 */
#define _LESENSE_EN_EN_ENABLE                   0x00000001UL                            /**< Mode ENABLE for LESENSE_EN                  */
#define LESENSE_EN_EN_DEFAULT                   (_LESENSE_EN_EN_DEFAULT << 0)           /**< Shifted mode DEFAULT for LESENSE_EN         */
#define LESENSE_EN_EN_DISABLE                   (_LESENSE_EN_EN_DISABLE << 0)           /**< Shifted mode DISABLE for LESENSE_EN         */
#define LESENSE_EN_EN_ENABLE                    (_LESENSE_EN_EN_ENABLE << 0)            /**< Shifted mode ENABLE for LESENSE_EN          */
#define LESENSE_EN_DISABLING                    (0x1UL << 1)                            /**< Disabling                                   */
#define _LESENSE_EN_DISABLING_SHIFT             1                                       /**< Shift value for LESENSE_DISABLING           */
#define _LESENSE_EN_DISABLING_MASK              0x2UL                                   /**< Bit mask for LESENSE_DISABLING              */
#define _LESENSE_EN_DISABLING_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LESENSE_EN                 */
#define LESENSE_EN_DISABLING_DEFAULT            (_LESENSE_EN_DISABLING_DEFAULT << 1)    /**< Shifted mode DEFAULT for LESENSE_EN         */

/* Bit fields for LESENSE SWRST */
#define _LESENSE_SWRST_RESETVALUE               0x00000000UL                            /**< Default value for LESENSE_SWRST             */
#define _LESENSE_SWRST_MASK                     0x00000003UL                            /**< Mask for LESENSE_SWRST                      */
#define LESENSE_SWRST_SWRST                     (0x1UL << 0)                            /**< Software reset command                      */
#define _LESENSE_SWRST_SWRST_SHIFT              0                                       /**< Shift value for LESENSE_SWRST               */
#define _LESENSE_SWRST_SWRST_MASK               0x1UL                                   /**< Bit mask for LESENSE_SWRST                  */
#define _LESENSE_SWRST_SWRST_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LESENSE_SWRST              */
#define LESENSE_SWRST_SWRST_DEFAULT             (_LESENSE_SWRST_SWRST_DEFAULT << 0)     /**< Shifted mode DEFAULT for LESENSE_SWRST      */
#define LESENSE_SWRST_RESETTING                 (0x1UL << 1)                            /**< Software reset busy status                  */
#define _LESENSE_SWRST_RESETTING_SHIFT          1                                       /**< Shift value for LESENSE_RESETTING           */
#define _LESENSE_SWRST_RESETTING_MASK           0x2UL                                   /**< Bit mask for LESENSE_RESETTING              */
#define _LESENSE_SWRST_RESETTING_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LESENSE_SWRST              */
#define LESENSE_SWRST_RESETTING_DEFAULT         (_LESENSE_SWRST_RESETTING_DEFAULT << 1) /**< Shifted mode DEFAULT for LESENSE_SWRST      */

/* Bit fields for LESENSE CFG */
#define _LESENSE_CFG_RESETVALUE                 0x00000000UL                            /**< Default value for LESENSE_CFG               */
#define _LESENSE_CFG_MASK                       0x00020FEFUL                            /**< Mask for LESENSE_CFG                        */
#define _LESENSE_CFG_SCANMODE_SHIFT             0                                       /**< Shift value for LESENSE_SCANMODE            */
#define _LESENSE_CFG_SCANMODE_MASK              0x3UL                                   /**< Bit mask for LESENSE_SCANMODE               */
#define _LESENSE_CFG_SCANMODE_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LESENSE_CFG                */
#define _LESENSE_CFG_SCANMODE_PERIODIC          0x00000000UL                            /**< Mode PERIODIC for LESENSE_CFG               */
#define _LESENSE_CFG_SCANMODE_ONESHOT           0x00000001UL                            /**< Mode ONESHOT for LESENSE_CFG                */
#define _LESENSE_CFG_SCANMODE_PRS               0x00000002UL                            /**< Mode PRS for LESENSE_CFG                    */
#define LESENSE_CFG_SCANMODE_DEFAULT            (_LESENSE_CFG_SCANMODE_DEFAULT << 0)    /**< Shifted mode DEFAULT for LESENSE_CFG        */
#define LESENSE_CFG_SCANMODE_PERIODIC           (_LESENSE_CFG_SCANMODE_PERIODIC << 0)   /**< Shifted mode PERIODIC for LESENSE_CFG       */
#define LESENSE_CFG_SCANMODE_ONESHOT            (_LESENSE_CFG_SCANMODE_ONESHOT << 0)    /**< Shifted mode ONESHOT for LESENSE_CFG        */
#define LESENSE_CFG_SCANMODE_PRS                (_LESENSE_CFG_SCANMODE_PRS << 0)        /**< Shifted mode PRS for LESENSE_CFG            */
#define _LESENSE_CFG_SCANCONF_SHIFT             2                                       /**< Shift value for LESENSE_SCANCONF            */
#define _LESENSE_CFG_SCANCONF_MASK              0xCUL                                   /**< Bit mask for LESENSE_SCANCONF               */
#define _LESENSE_CFG_SCANCONF_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LESENSE_CFG                */
#define _LESENSE_CFG_SCANCONF_DIRMAP            0x00000000UL                            /**< Mode DIRMAP for LESENSE_CFG                 */
#define _LESENSE_CFG_SCANCONF_INVMAP            0x00000001UL                            /**< Mode INVMAP for LESENSE_CFG                 */
#define _LESENSE_CFG_SCANCONF_TOGGLE            0x00000002UL                            /**< Mode TOGGLE for LESENSE_CFG                 */
#define _LESENSE_CFG_SCANCONF_DECDEF            0x00000003UL                            /**< Mode DECDEF for LESENSE_CFG                 */
#define LESENSE_CFG_SCANCONF_DEFAULT            (_LESENSE_CFG_SCANCONF_DEFAULT << 2)    /**< Shifted mode DEFAULT for LESENSE_CFG        */
#define LESENSE_CFG_SCANCONF_DIRMAP             (_LESENSE_CFG_SCANCONF_DIRMAP << 2)     /**< Shifted mode DIRMAP for LESENSE_CFG         */
#define LESENSE_CFG_SCANCONF_INVMAP             (_LESENSE_CFG_SCANCONF_INVMAP << 2)     /**< Shifted mode INVMAP for LESENSE_CFG         */
#define LESENSE_CFG_SCANCONF_TOGGLE             (_LESENSE_CFG_SCANCONF_TOGGLE << 2)     /**< Shifted mode TOGGLE for LESENSE_CFG         */
#define LESENSE_CFG_SCANCONF_DECDEF             (_LESENSE_CFG_SCANCONF_DECDEF << 2)     /**< Shifted mode DECDEF for LESENSE_CFG         */
#define LESENSE_CFG_DUALSAMPLE                  (0x1UL << 5)                            /**< Enable dual sample mode                     */
#define _LESENSE_CFG_DUALSAMPLE_SHIFT           5                                       /**< Shift value for LESENSE_DUALSAMPLE          */
#define _LESENSE_CFG_DUALSAMPLE_MASK            0x20UL                                  /**< Bit mask for LESENSE_DUALSAMPLE             */
#define _LESENSE_CFG_DUALSAMPLE_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LESENSE_CFG                */
#define LESENSE_CFG_DUALSAMPLE_DEFAULT          (_LESENSE_CFG_DUALSAMPLE_DEFAULT << 5)  /**< Shifted mode DEFAULT for LESENSE_CFG        */
#define LESENSE_CFG_STRSCANRES                  (0x1UL << 6)                            /**< Enable storing of SCANRES                   */
#define _LESENSE_CFG_STRSCANRES_SHIFT           6                                       /**< Shift value for LESENSE_STRSCANRES          */
#define _LESENSE_CFG_STRSCANRES_MASK            0x40UL                                  /**< Bit mask for LESENSE_STRSCANRES             */
#define _LESENSE_CFG_STRSCANRES_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LESENSE_CFG                */
#define LESENSE_CFG_STRSCANRES_DEFAULT          (_LESENSE_CFG_STRSCANRES_DEFAULT << 6)  /**< Shifted mode DEFAULT for LESENSE_CFG        */
#define LESENSE_CFG_DMAWU                       (0x1UL << 7)                            /**< DMA wake-up from EM2                        */
#define _LESENSE_CFG_DMAWU_SHIFT                7                                       /**< Shift value for LESENSE_DMAWU               */
#define _LESENSE_CFG_DMAWU_MASK                 0x80UL                                  /**< Bit mask for LESENSE_DMAWU                  */
#define _LESENSE_CFG_DMAWU_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LESENSE_CFG                */
#define _LESENSE_CFG_DMAWU_DISABLE              0x00000000UL                            /**< Mode DISABLE for LESENSE_CFG                */
#define _LESENSE_CFG_DMAWU_ENABLE               0x00000001UL                            /**< Mode ENABLE for LESENSE_CFG                 */
#define LESENSE_CFG_DMAWU_DEFAULT               (_LESENSE_CFG_DMAWU_DEFAULT << 7)       /**< Shifted mode DEFAULT for LESENSE_CFG        */
#define LESENSE_CFG_DMAWU_DISABLE               (_LESENSE_CFG_DMAWU_DISABLE << 7)       /**< Shifted mode DISABLE for LESENSE_CFG        */
#define LESENSE_CFG_DMAWU_ENABLE                (_LESENSE_CFG_DMAWU_ENABLE << 7)        /**< Shifted mode ENABLE for LESENSE_CFG         */
#define _LESENSE_CFG_RESFIDL_SHIFT              8                                       /**< Shift value for LESENSE_RESFIDL             */
#define _LESENSE_CFG_RESFIDL_MASK               0xF00UL                                 /**< Bit mask for LESENSE_RESFIDL                */
#define _LESENSE_CFG_RESFIDL_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LESENSE_CFG                */
#define LESENSE_CFG_RESFIDL_DEFAULT             (_LESENSE_CFG_RESFIDL_DEFAULT << 8)     /**< Shifted mode DEFAULT for LESENSE_CFG        */
#define LESENSE_CFG_DEBUGRUN                    (0x1UL << 17)                           /**< Debug Mode Run Enable                       */
#define _LESENSE_CFG_DEBUGRUN_SHIFT             17                                      /**< Shift value for LESENSE_DEBUGRUN            */
#define _LESENSE_CFG_DEBUGRUN_MASK              0x20000UL                               /**< Bit mask for LESENSE_DEBUGRUN               */
#define _LESENSE_CFG_DEBUGRUN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LESENSE_CFG                */
#define _LESENSE_CFG_DEBUGRUN_X0                0x00000000UL                            /**< Mode X0 for LESENSE_CFG                     */
#define _LESENSE_CFG_DEBUGRUN_X1                0x00000001UL                            /**< Mode X1 for LESENSE_CFG                     */
#define LESENSE_CFG_DEBUGRUN_DEFAULT            (_LESENSE_CFG_DEBUGRUN_DEFAULT << 17)   /**< Shifted mode DEFAULT for LESENSE_CFG        */
#define LESENSE_CFG_DEBUGRUN_X0                 (_LESENSE_CFG_DEBUGRUN_X0 << 17)        /**< Shifted mode X0 for LESENSE_CFG             */
#define LESENSE_CFG_DEBUGRUN_X1                 (_LESENSE_CFG_DEBUGRUN_X1 << 17)        /**< Shifted mode X1 for LESENSE_CFG             */

/* Bit fields for LESENSE TIMCTRL */
#define _LESENSE_TIMCTRL_RESETVALUE             0x00000000UL                            /**< Default value for LESENSE_TIMCTRL           */
#define _LESENSE_TIMCTRL_MASK                   0x10CFF773UL                            /**< Mask for LESENSE_TIMCTRL                    */
#define _LESENSE_TIMCTRL_AUXPRESC_SHIFT         0                                       /**< Shift value for LESENSE_AUXPRESC            */
#define _LESENSE_TIMCTRL_AUXPRESC_MASK          0x3UL                                   /**< Bit mask for LESENSE_AUXPRESC               */
#define _LESENSE_TIMCTRL_AUXPRESC_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_TIMCTRL            */
#define _LESENSE_TIMCTRL_AUXPRESC_DIV1          0x00000000UL                            /**< Mode DIV1 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_AUXPRESC_DIV2          0x00000001UL                            /**< Mode DIV2 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_AUXPRESC_DIV4          0x00000002UL                            /**< Mode DIV4 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_AUXPRESC_DIV8          0x00000003UL                            /**< Mode DIV8 for LESENSE_TIMCTRL               */
#define LESENSE_TIMCTRL_AUXPRESC_DEFAULT        (_LESENSE_TIMCTRL_AUXPRESC_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_TIMCTRL    */
#define LESENSE_TIMCTRL_AUXPRESC_DIV1           (_LESENSE_TIMCTRL_AUXPRESC_DIV1 << 0)   /**< Shifted mode DIV1 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_AUXPRESC_DIV2           (_LESENSE_TIMCTRL_AUXPRESC_DIV2 << 0)   /**< Shifted mode DIV2 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_AUXPRESC_DIV4           (_LESENSE_TIMCTRL_AUXPRESC_DIV4 << 0)   /**< Shifted mode DIV4 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_AUXPRESC_DIV8           (_LESENSE_TIMCTRL_AUXPRESC_DIV8 << 0)   /**< Shifted mode DIV8 for LESENSE_TIMCTRL       */
#define _LESENSE_TIMCTRL_LFPRESC_SHIFT          4                                       /**< Shift value for LESENSE_LFPRESC             */
#define _LESENSE_TIMCTRL_LFPRESC_MASK           0x70UL                                  /**< Bit mask for LESENSE_LFPRESC                */
#define _LESENSE_TIMCTRL_LFPRESC_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LESENSE_TIMCTRL            */
#define _LESENSE_TIMCTRL_LFPRESC_DIV1           0x00000000UL                            /**< Mode DIV1 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_LFPRESC_DIV2           0x00000001UL                            /**< Mode DIV2 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_LFPRESC_DIV4           0x00000002UL                            /**< Mode DIV4 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_LFPRESC_DIV8           0x00000003UL                            /**< Mode DIV8 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_LFPRESC_DIV16          0x00000004UL                            /**< Mode DIV16 for LESENSE_TIMCTRL              */
#define _LESENSE_TIMCTRL_LFPRESC_DIV32          0x00000005UL                            /**< Mode DIV32 for LESENSE_TIMCTRL              */
#define _LESENSE_TIMCTRL_LFPRESC_DIV64          0x00000006UL                            /**< Mode DIV64 for LESENSE_TIMCTRL              */
#define _LESENSE_TIMCTRL_LFPRESC_DIV128         0x00000007UL                            /**< Mode DIV128 for LESENSE_TIMCTRL             */
#define LESENSE_TIMCTRL_LFPRESC_DEFAULT         (_LESENSE_TIMCTRL_LFPRESC_DEFAULT << 4) /**< Shifted mode DEFAULT for LESENSE_TIMCTRL    */
#define LESENSE_TIMCTRL_LFPRESC_DIV1            (_LESENSE_TIMCTRL_LFPRESC_DIV1 << 4)    /**< Shifted mode DIV1 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_LFPRESC_DIV2            (_LESENSE_TIMCTRL_LFPRESC_DIV2 << 4)    /**< Shifted mode DIV2 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_LFPRESC_DIV4            (_LESENSE_TIMCTRL_LFPRESC_DIV4 << 4)    /**< Shifted mode DIV4 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_LFPRESC_DIV8            (_LESENSE_TIMCTRL_LFPRESC_DIV8 << 4)    /**< Shifted mode DIV8 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_LFPRESC_DIV16           (_LESENSE_TIMCTRL_LFPRESC_DIV16 << 4)   /**< Shifted mode DIV16 for LESENSE_TIMCTRL      */
#define LESENSE_TIMCTRL_LFPRESC_DIV32           (_LESENSE_TIMCTRL_LFPRESC_DIV32 << 4)   /**< Shifted mode DIV32 for LESENSE_TIMCTRL      */
#define LESENSE_TIMCTRL_LFPRESC_DIV64           (_LESENSE_TIMCTRL_LFPRESC_DIV64 << 4)   /**< Shifted mode DIV64 for LESENSE_TIMCTRL      */
#define LESENSE_TIMCTRL_LFPRESC_DIV128          (_LESENSE_TIMCTRL_LFPRESC_DIV128 << 4)  /**< Shifted mode DIV128 for LESENSE_TIMCTRL     */
#define _LESENSE_TIMCTRL_PCPRESC_SHIFT          8                                       /**< Shift value for LESENSE_PCPRESC             */
#define _LESENSE_TIMCTRL_PCPRESC_MASK           0x700UL                                 /**< Bit mask for LESENSE_PCPRESC                */
#define _LESENSE_TIMCTRL_PCPRESC_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LESENSE_TIMCTRL            */
#define _LESENSE_TIMCTRL_PCPRESC_DIV1           0x00000000UL                            /**< Mode DIV1 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_PCPRESC_DIV2           0x00000001UL                            /**< Mode DIV2 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_PCPRESC_DIV4           0x00000002UL                            /**< Mode DIV4 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_PCPRESC_DIV8           0x00000003UL                            /**< Mode DIV8 for LESENSE_TIMCTRL               */
#define _LESENSE_TIMCTRL_PCPRESC_DIV16          0x00000004UL                            /**< Mode DIV16 for LESENSE_TIMCTRL              */
#define _LESENSE_TIMCTRL_PCPRESC_DIV32          0x00000005UL                            /**< Mode DIV32 for LESENSE_TIMCTRL              */
#define _LESENSE_TIMCTRL_PCPRESC_DIV64          0x00000006UL                            /**< Mode DIV64 for LESENSE_TIMCTRL              */
#define _LESENSE_TIMCTRL_PCPRESC_DIV128         0x00000007UL                            /**< Mode DIV128 for LESENSE_TIMCTRL             */
#define LESENSE_TIMCTRL_PCPRESC_DEFAULT         (_LESENSE_TIMCTRL_PCPRESC_DEFAULT << 8) /**< Shifted mode DEFAULT for LESENSE_TIMCTRL    */
#define LESENSE_TIMCTRL_PCPRESC_DIV1            (_LESENSE_TIMCTRL_PCPRESC_DIV1 << 8)    /**< Shifted mode DIV1 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_PCPRESC_DIV2            (_LESENSE_TIMCTRL_PCPRESC_DIV2 << 8)    /**< Shifted mode DIV2 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_PCPRESC_DIV4            (_LESENSE_TIMCTRL_PCPRESC_DIV4 << 8)    /**< Shifted mode DIV4 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_PCPRESC_DIV8            (_LESENSE_TIMCTRL_PCPRESC_DIV8 << 8)    /**< Shifted mode DIV8 for LESENSE_TIMCTRL       */
#define LESENSE_TIMCTRL_PCPRESC_DIV16           (_LESENSE_TIMCTRL_PCPRESC_DIV16 << 8)   /**< Shifted mode DIV16 for LESENSE_TIMCTRL      */
#define LESENSE_TIMCTRL_PCPRESC_DIV32           (_LESENSE_TIMCTRL_PCPRESC_DIV32 << 8)   /**< Shifted mode DIV32 for LESENSE_TIMCTRL      */
#define LESENSE_TIMCTRL_PCPRESC_DIV64           (_LESENSE_TIMCTRL_PCPRESC_DIV64 << 8)   /**< Shifted mode DIV64 for LESENSE_TIMCTRL      */
#define LESENSE_TIMCTRL_PCPRESC_DIV128          (_LESENSE_TIMCTRL_PCPRESC_DIV128 << 8)  /**< Shifted mode DIV128 for LESENSE_TIMCTRL     */
#define _LESENSE_TIMCTRL_PCTOP_SHIFT            12                                      /**< Shift value for LESENSE_PCTOP               */
#define _LESENSE_TIMCTRL_PCTOP_MASK             0xFF000UL                               /**< Bit mask for LESENSE_PCTOP                  */
#define _LESENSE_TIMCTRL_PCTOP_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for LESENSE_TIMCTRL            */
#define LESENSE_TIMCTRL_PCTOP_DEFAULT           (_LESENSE_TIMCTRL_PCTOP_DEFAULT << 12)  /**< Shifted mode DEFAULT for LESENSE_TIMCTRL    */
#define _LESENSE_TIMCTRL_STARTDLY_SHIFT         22                                      /**< Shift value for LESENSE_STARTDLY            */
#define _LESENSE_TIMCTRL_STARTDLY_MASK          0xC00000UL                              /**< Bit mask for LESENSE_STARTDLY               */
#define _LESENSE_TIMCTRL_STARTDLY_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_TIMCTRL            */
#define LESENSE_TIMCTRL_STARTDLY_DEFAULT        (_LESENSE_TIMCTRL_STARTDLY_DEFAULT << 22) /**< Shifted mode DEFAULT for LESENSE_TIMCTRL    */
#define LESENSE_TIMCTRL_AUXSTARTUP              (0x1UL << 28)                           /**< AUX startup config                          */
#define _LESENSE_TIMCTRL_AUXSTARTUP_SHIFT       28                                      /**< Shift value for LESENSE_AUXSTARTUP          */
#define _LESENSE_TIMCTRL_AUXSTARTUP_MASK        0x10000000UL                            /**< Bit mask for LESENSE_AUXSTARTUP             */
#define _LESENSE_TIMCTRL_AUXSTARTUP_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for LESENSE_TIMCTRL            */
#define _LESENSE_TIMCTRL_AUXSTARTUP_PREDEMAND   0x00000000UL                            /**< Mode PREDEMAND for LESENSE_TIMCTRL          */
#define _LESENSE_TIMCTRL_AUXSTARTUP_ONDEMAND    0x00000001UL                            /**< Mode ONDEMAND for LESENSE_TIMCTRL           */
#define LESENSE_TIMCTRL_AUXSTARTUP_DEFAULT      (_LESENSE_TIMCTRL_AUXSTARTUP_DEFAULT << 28) /**< Shifted mode DEFAULT for LESENSE_TIMCTRL    */
#define LESENSE_TIMCTRL_AUXSTARTUP_PREDEMAND    (_LESENSE_TIMCTRL_AUXSTARTUP_PREDEMAND << 28) /**< Shifted mode PREDEMAND for LESENSE_TIMCTRL  */
#define LESENSE_TIMCTRL_AUXSTARTUP_ONDEMAND     (_LESENSE_TIMCTRL_AUXSTARTUP_ONDEMAND << 28) /**< Shifted mode ONDEMAND for LESENSE_TIMCTRL   */

