SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_lesense.h
/* Bit fields for LESENSE EVALCTRL */
#define _LESENSE_EVALCTRL_RESETVALUE            0x00000000UL                            /**< Default value for LESENSE_EVALCTRL          */
#define _LESENSE_EVALCTRL_MASK                  0x0000FFFFUL                            /**< Mask for LESENSE_EVALCTRL                   */
#define _LESENSE_EVALCTRL_WINSIZE_SHIFT         0                                       /**< Shift value for LESENSE_WINSIZE             */
#define _LESENSE_EVALCTRL_WINSIZE_MASK          0xFFFFUL                                /**< Bit mask for LESENSE_WINSIZE                */
#define _LESENSE_EVALCTRL_WINSIZE_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_EVALCTRL           */
#define LESENSE_EVALCTRL_WINSIZE_DEFAULT        (_LESENSE_EVALCTRL_WINSIZE_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_EVALCTRL   */

/* Bit fields for LESENSE PRSCTRL */
#define _LESENSE_PRSCTRL_RESETVALUE             0x00000000UL                            /**< Default value for LESENSE_PRSCTRL           */
#define _LESENSE_PRSCTRL_MASK                   0x00011F1FUL                            /**< Mask for LESENSE_PRSCTRL                    */
#define _LESENSE_PRSCTRL_DECCMPVAL_SHIFT        0                                       /**< Shift value for LESENSE_DECCMPVAL           */
#define _LESENSE_PRSCTRL_DECCMPVAL_MASK         0x1FUL                                  /**< Bit mask for LESENSE_DECCMPVAL              */
#define _LESENSE_PRSCTRL_DECCMPVAL_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_PRSCTRL            */
#define LESENSE_PRSCTRL_DECCMPVAL_DEFAULT       (_LESENSE_PRSCTRL_DECCMPVAL_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_PRSCTRL    */
#define _LESENSE_PRSCTRL_DECCMPMASK_SHIFT       8                                       /**< Shift value for LESENSE_DECCMPMASK          */
#define _LESENSE_PRSCTRL_DECCMPMASK_MASK        0x1F00UL                                /**< Bit mask for LESENSE_DECCMPMASK             */
#define _LESENSE_PRSCTRL_DECCMPMASK_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for LESENSE_PRSCTRL            */
#define LESENSE_PRSCTRL_DECCMPMASK_DEFAULT      (_LESENSE_PRSCTRL_DECCMPMASK_DEFAULT << 8) /**< Shifted mode DEFAULT for LESENSE_PRSCTRL    */
#define LESENSE_PRSCTRL_DECCMPEN                (0x1UL << 16)                           /**< Enable PRS output DECCMP                    */
#define _LESENSE_PRSCTRL_DECCMPEN_SHIFT         16                                      /**< Shift value for LESENSE_DECCMPEN            */
#define _LESENSE_PRSCTRL_DECCMPEN_MASK          0x10000UL                               /**< Bit mask for LESENSE_DECCMPEN               */
#define _LESENSE_PRSCTRL_DECCMPEN_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_PRSCTRL            */
#define LESENSE_PRSCTRL_DECCMPEN_DEFAULT        (_LESENSE_PRSCTRL_DECCMPEN_DEFAULT << 16) /**< Shifted mode DEFAULT for LESENSE_PRSCTRL    */

/* Bit fields for LESENSE CMD */
#define _LESENSE_CMD_RESETVALUE                 0x00000000UL                            /**< Default value for LESENSE_CMD               */
#define _LESENSE_CMD_MASK                       0x0000000FUL                            /**< Mask for LESENSE_CMD                        */
#define LESENSE_CMD_START                       (0x1UL << 0)                            /**< Start scanning of sensors.                  */
#define _LESENSE_CMD_START_SHIFT                0                                       /**< Shift value for LESENSE_START               */
#define _LESENSE_CMD_START_MASK                 0x1UL                                   /**< Bit mask for LESENSE_START                  */
#define _LESENSE_CMD_START_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LESENSE_CMD                */
#define LESENSE_CMD_START_DEFAULT               (_LESENSE_CMD_START_DEFAULT << 0)       /**< Shifted mode DEFAULT for LESENSE_CMD        */
#define LESENSE_CMD_STOP                        (0x1UL << 1)                            /**< Stop scanning of sensors                    */
#define _LESENSE_CMD_STOP_SHIFT                 1                                       /**< Shift value for LESENSE_STOP                */
#define _LESENSE_CMD_STOP_MASK                  0x2UL                                   /**< Bit mask for LESENSE_STOP                   */
#define _LESENSE_CMD_STOP_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for LESENSE_CMD                */
#define LESENSE_CMD_STOP_DEFAULT                (_LESENSE_CMD_STOP_DEFAULT << 1)        /**< Shifted mode DEFAULT for LESENSE_CMD        */
#define LESENSE_CMD_DECODE                      (0x1UL << 2)                            /**< Start decoder                               */
#define _LESENSE_CMD_DECODE_SHIFT               2                                       /**< Shift value for LESENSE_DECODE              */
#define _LESENSE_CMD_DECODE_MASK                0x4UL                                   /**< Bit mask for LESENSE_DECODE                 */
#define _LESENSE_CMD_DECODE_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for LESENSE_CMD                */
#define LESENSE_CMD_DECODE_DEFAULT              (_LESENSE_CMD_DECODE_DEFAULT << 2)      /**< Shifted mode DEFAULT for LESENSE_CMD        */
#define LESENSE_CMD_CLEARBUF                    (0x1UL << 3)                            /**< Clear result buffer                         */
#define _LESENSE_CMD_CLEARBUF_SHIFT             3                                       /**< Shift value for LESENSE_CLEARBUF            */
#define _LESENSE_CMD_CLEARBUF_MASK              0x8UL                                   /**< Bit mask for LESENSE_CLEARBUF               */
#define _LESENSE_CMD_CLEARBUF_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for LESENSE_CMD                */
#define LESENSE_CMD_CLEARBUF_DEFAULT            (_LESENSE_CMD_CLEARBUF_DEFAULT << 3)    /**< Shifted mode DEFAULT for LESENSE_CMD        */

