SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_lesense.h
/* Bit fields for LESENSE CHEN */
#define _LESENSE_CHEN_RESETVALUE                0x00000000UL                            /**< Default value for LESENSE_CHEN              */
#define _LESENSE_CHEN_MASK                      0x0000FFFFUL                            /**< Mask for LESENSE_CHEN                       */
#define _LESENSE_CHEN_CHEN_SHIFT                0                                       /**< Shift value for LESENSE_CHEN                */
#define _LESENSE_CHEN_CHEN_MASK                 0xFFFFUL                                /**< Bit mask for LESENSE_CHEN                   */
#define _LESENSE_CHEN_CHEN_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LESENSE_CHEN               */
#define LESENSE_CHEN_CHEN_DEFAULT               (_LESENSE_CHEN_CHEN_DEFAULT << 0)       /**< Shifted mode DEFAULT for LESENSE_CHEN       */

/* Bit fields for LESENSE SCANRES */
#define _LESENSE_SCANRES_RESETVALUE             0x00000000UL                            /**< Default value for LESENSE_SCANRES           */
#define _LESENSE_SCANRES_MASK                   0xFFFFFFFFUL                            /**< Mask for LESENSE_SCANRES                    */
#define _LESENSE_SCANRES_SCANRES_SHIFT          0                                       /**< Shift value for LESENSE_SCANRES             */
#define _LESENSE_SCANRES_SCANRES_MASK           0xFFFFUL                                /**< Bit mask for LESENSE_SCANRES                */
#define _LESENSE_SCANRES_SCANRES_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LESENSE_SCANRES            */
#define LESENSE_SCANRES_SCANRES_DEFAULT         (_LESENSE_SCANRES_SCANRES_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_SCANRES    */
#define _LESENSE_SCANRES_STEPDIR_SHIFT          16                                      /**< Shift value for LESENSE_STEPDIR             */
#define _LESENSE_SCANRES_STEPDIR_MASK           0xFFFF0000UL                            /**< Bit mask for LESENSE_STEPDIR                */
#define _LESENSE_SCANRES_STEPDIR_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LESENSE_SCANRES            */
#define LESENSE_SCANRES_STEPDIR_DEFAULT         (_LESENSE_SCANRES_STEPDIR_DEFAULT << 16) /**< Shifted mode DEFAULT for LESENSE_SCANRES    */

/* Bit fields for LESENSE STATUS */
#define _LESENSE_STATUS_RESETVALUE              0x00000000UL                            /**< Default value for LESENSE_STATUS            */
#define _LESENSE_STATUS_MASK                    0x0000007BUL                            /**< Mask for LESENSE_STATUS                     */
#define LESENSE_STATUS_RESFIFOV                 (0x1UL << 0)                            /**< Result fifo valid                           */
#define _LESENSE_STATUS_RESFIFOV_SHIFT          0                                       /**< Shift value for LESENSE_RESFIFOV            */
#define _LESENSE_STATUS_RESFIFOV_MASK           0x1UL                                   /**< Bit mask for LESENSE_RESFIFOV               */
#define _LESENSE_STATUS_RESFIFOV_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LESENSE_STATUS             */
#define LESENSE_STATUS_RESFIFOV_DEFAULT         (_LESENSE_STATUS_RESFIFOV_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_STATUS     */
#define LESENSE_STATUS_RESFIFOFULL              (0x1UL << 1)                            /**< Result fifo full                            */
#define _LESENSE_STATUS_RESFIFOFULL_SHIFT       1                                       /**< Shift value for LESENSE_RESFIFOFULL         */
#define _LESENSE_STATUS_RESFIFOFULL_MASK        0x2UL                                   /**< Bit mask for LESENSE_RESFIFOFULL            */
#define _LESENSE_STATUS_RESFIFOFULL_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for LESENSE_STATUS             */
#define LESENSE_STATUS_RESFIFOFULL_DEFAULT      (_LESENSE_STATUS_RESFIFOFULL_DEFAULT << 1) /**< Shifted mode DEFAULT for LESENSE_STATUS     */
#define LESENSE_STATUS_SCANACTIVE               (0x1UL << 3)                            /**< LESENSE scan active                         */
#define _LESENSE_STATUS_SCANACTIVE_SHIFT        3                                       /**< Shift value for LESENSE_SCANACTIVE          */
#define _LESENSE_STATUS_SCANACTIVE_MASK         0x8UL                                   /**< Bit mask for LESENSE_SCANACTIVE             */
#define _LESENSE_STATUS_SCANACTIVE_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_STATUS             */
#define LESENSE_STATUS_SCANACTIVE_DEFAULT       (_LESENSE_STATUS_SCANACTIVE_DEFAULT << 3) /**< Shifted mode DEFAULT for LESENSE_STATUS     */
#define LESENSE_STATUS_RUNNING                  (0x1UL << 4)                            /**< LESENSE periodic counter running            */
#define _LESENSE_STATUS_RUNNING_SHIFT           4                                       /**< Shift value for LESENSE_RUNNING             */
#define _LESENSE_STATUS_RUNNING_MASK            0x10UL                                  /**< Bit mask for LESENSE_RUNNING                */
#define _LESENSE_STATUS_RUNNING_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LESENSE_STATUS             */
#define LESENSE_STATUS_RUNNING_DEFAULT          (_LESENSE_STATUS_RUNNING_DEFAULT << 4)  /**< Shifted mode DEFAULT for LESENSE_STATUS     */
#define LESENSE_STATUS_READBUSY                 (0x1UL << 5)                            /**< FIFO Read Busy                              */
#define _LESENSE_STATUS_READBUSY_SHIFT          5                                       /**< Shift value for LESENSE_READBUSY            */
#define _LESENSE_STATUS_READBUSY_MASK           0x20UL                                  /**< Bit mask for LESENSE_READBUSY               */
#define _LESENSE_STATUS_READBUSY_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LESENSE_STATUS             */
#define LESENSE_STATUS_READBUSY_DEFAULT         (_LESENSE_STATUS_READBUSY_DEFAULT << 5) /**< Shifted mode DEFAULT for LESENSE_STATUS     */
#define LESENSE_STATUS_FLUSHING                 (0x1UL << 6)                            /**< FIFO Flushing                               */
#define _LESENSE_STATUS_FLUSHING_SHIFT          6                                       /**< Shift value for LESENSE_FLUSHING            */
#define _LESENSE_STATUS_FLUSHING_MASK           0x40UL                                  /**< Bit mask for LESENSE_FLUSHING               */
#define _LESENSE_STATUS_FLUSHING_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for LESENSE_STATUS             */
#define LESENSE_STATUS_FLUSHING_DEFAULT         (_LESENSE_STATUS_FLUSHING_DEFAULT << 6) /**< Shifted mode DEFAULT for LESENSE_STATUS     */

/* Bit fields for LESENSE RESCOUNT */
#define _LESENSE_RESCOUNT_RESETVALUE            0x00000000UL                            /**< Default value for LESENSE_RESCOUNT          */
#define _LESENSE_RESCOUNT_MASK                  0x0000001FUL                            /**< Mask for LESENSE_RESCOUNT                   */
#define _LESENSE_RESCOUNT_COUNT_SHIFT           0                                       /**< Shift value for LESENSE_COUNT               */
#define _LESENSE_RESCOUNT_COUNT_MASK            0x1FUL                                  /**< Bit mask for LESENSE_COUNT                  */
#define _LESENSE_RESCOUNT_COUNT_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for LESENSE_RESCOUNT           */
#define LESENSE_RESCOUNT_COUNT_DEFAULT          (_LESENSE_RESCOUNT_COUNT_DEFAULT << 0)  /**< Shifted mode DEFAULT for LESENSE_RESCOUNT   */

/* Bit fields for LESENSE RESFIFO */
#define _LESENSE_RESFIFO_RESETVALUE             0x00000000UL                            /**< Default value for LESENSE_RESFIFO           */
#define _LESENSE_RESFIFO_MASK                   0x000FFFFFUL                            /**< Mask for LESENSE_RESFIFO                    */
#define _LESENSE_RESFIFO_BUFDATASRC_SHIFT       0                                       /**< Shift value for LESENSE_BUFDATASRC          */
#define _LESENSE_RESFIFO_BUFDATASRC_MASK        0xFFFFFUL                               /**< Bit mask for LESENSE_BUFDATASRC             */
#define _LESENSE_RESFIFO_BUFDATASRC_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for LESENSE_RESFIFO            */
#define LESENSE_RESFIFO_BUFDATASRC_DEFAULT      (_LESENSE_RESFIFO_BUFDATASRC_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_RESFIFO    */

/* Bit fields for LESENSE CURCH */
#define _LESENSE_CURCH_RESETVALUE               0x00000000UL                            /**< Default value for LESENSE_CURCH             */
#define _LESENSE_CURCH_MASK                     0x0000000FUL                            /**< Mask for LESENSE_CURCH                      */
#define _LESENSE_CURCH_CURCH_SHIFT              0                                       /**< Shift value for LESENSE_CURCH               */
#define _LESENSE_CURCH_CURCH_MASK               0xFUL                                   /**< Bit mask for LESENSE_CURCH                  */
#define _LESENSE_CURCH_CURCH_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for LESENSE_CURCH              */
#define LESENSE_CURCH_CURCH_DEFAULT             (_LESENSE_CURCH_CURCH_DEFAULT << 0)     /**< Shifted mode DEFAULT for LESENSE_CURCH      */

