SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_lesense.h
/* Bit fields for LESENSE DECSTATE */
#define _LESENSE_DECSTATE_RESETVALUE            0x00000000UL                            /**< Default value for LESENSE_DECSTATE          */
#define _LESENSE_DECSTATE_MASK                  0x0000001FUL                            /**< Mask for LESENSE_DECSTATE                   */
#define _LESENSE_DECSTATE_DECSTATE_SHIFT        0                                       /**< Shift value for LESENSE_DECSTATE            */
#define _LESENSE_DECSTATE_DECSTATE_MASK         0x1FUL                                  /**< Bit mask for LESENSE_DECSTATE               */
#define _LESENSE_DECSTATE_DECSTATE_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_DECSTATE           */
#define LESENSE_DECSTATE_DECSTATE_DEFAULT       (_LESENSE_DECSTATE_DECSTATE_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_DECSTATE   */

/* Bit fields for LESENSE SENSORSTATE */
#define _LESENSE_SENSORSTATE_RESETVALUE         0x00000000UL                            /**< Default value for LESENSE_SENSORSTATE       */
#define _LESENSE_SENSORSTATE_MASK               0x0000000FUL                            /**< Mask for LESENSE_SENSORSTATE                */
#define _LESENSE_SENSORSTATE_SENSORSTATE_SHIFT  0                                       /**< Shift value for LESENSE_SENSORSTATE         */
#define _LESENSE_SENSORSTATE_SENSORSTATE_MASK   0xFUL                                   /**< Bit mask for LESENSE_SENSORSTATE            */
#define _LESENSE_SENSORSTATE_SENSORSTATE_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for LESENSE_SENSORSTATE        */
#define LESENSE_SENSORSTATE_SENSORSTATE_DEFAULT (_LESENSE_SENSORSTATE_SENSORSTATE_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_SENSORSTATE*/

/* Bit fields for LESENSE IDLECONF */
#define _LESENSE_IDLECONF_RESETVALUE            0x00000000UL                            /**< Default value for LESENSE_IDLECONF          */
#define _LESENSE_IDLECONF_MASK                  0xFFFFFFFFUL                            /**< Mask for LESENSE_IDLECONF                   */
#define _LESENSE_IDLECONF_CHIDLE0_SHIFT         0                                       /**< Shift value for LESENSE_CHIDLE0             */
#define _LESENSE_IDLECONF_CHIDLE0_MASK          0x3UL                                   /**< Bit mask for LESENSE_CHIDLE0                */
#define _LESENSE_IDLECONF_CHIDLE0_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE0_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE0_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE0_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE0_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE0_DEFAULT        (_LESENSE_IDLECONF_CHIDLE0_DEFAULT << 0) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE0_DISABLE        (_LESENSE_IDLECONF_CHIDLE0_DISABLE << 0) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE0_HIGH           (_LESENSE_IDLECONF_CHIDLE0_HIGH << 0)   /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE0_LOW            (_LESENSE_IDLECONF_CHIDLE0_LOW << 0)    /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE0_DAC            (_LESENSE_IDLECONF_CHIDLE0_DAC << 0)    /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE1_SHIFT         2                                       /**< Shift value for LESENSE_CHIDLE1             */
#define _LESENSE_IDLECONF_CHIDLE1_MASK          0xCUL                                   /**< Bit mask for LESENSE_CHIDLE1                */
#define _LESENSE_IDLECONF_CHIDLE1_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE1_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE1_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE1_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE1_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE1_DEFAULT        (_LESENSE_IDLECONF_CHIDLE1_DEFAULT << 2) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE1_DISABLE        (_LESENSE_IDLECONF_CHIDLE1_DISABLE << 2) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE1_HIGH           (_LESENSE_IDLECONF_CHIDLE1_HIGH << 2)   /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE1_LOW            (_LESENSE_IDLECONF_CHIDLE1_LOW << 2)    /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE1_DAC            (_LESENSE_IDLECONF_CHIDLE1_DAC << 2)    /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE2_SHIFT         4                                       /**< Shift value for LESENSE_CHIDLE2             */
#define _LESENSE_IDLECONF_CHIDLE2_MASK          0x30UL                                  /**< Bit mask for LESENSE_CHIDLE2                */
#define _LESENSE_IDLECONF_CHIDLE2_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE2_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE2_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE2_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE2_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE2_DEFAULT        (_LESENSE_IDLECONF_CHIDLE2_DEFAULT << 4) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE2_DISABLE        (_LESENSE_IDLECONF_CHIDLE2_DISABLE << 4) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE2_HIGH           (_LESENSE_IDLECONF_CHIDLE2_HIGH << 4)   /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE2_LOW            (_LESENSE_IDLECONF_CHIDLE2_LOW << 4)    /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE2_DAC            (_LESENSE_IDLECONF_CHIDLE2_DAC << 4)    /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE3_SHIFT         6                                       /**< Shift value for LESENSE_CHIDLE3             */
#define _LESENSE_IDLECONF_CHIDLE3_MASK          0xC0UL                                  /**< Bit mask for LESENSE_CHIDLE3                */
#define _LESENSE_IDLECONF_CHIDLE3_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE3_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE3_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE3_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE3_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE3_DEFAULT        (_LESENSE_IDLECONF_CHIDLE3_DEFAULT << 6) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE3_DISABLE        (_LESENSE_IDLECONF_CHIDLE3_DISABLE << 6) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE3_HIGH           (_LESENSE_IDLECONF_CHIDLE3_HIGH << 6)   /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE3_LOW            (_LESENSE_IDLECONF_CHIDLE3_LOW << 6)    /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE3_DAC            (_LESENSE_IDLECONF_CHIDLE3_DAC << 6)    /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE4_SHIFT         8                                       /**< Shift value for LESENSE_CHIDLE4             */
#define _LESENSE_IDLECONF_CHIDLE4_MASK          0x300UL                                 /**< Bit mask for LESENSE_CHIDLE4                */
#define _LESENSE_IDLECONF_CHIDLE4_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE4_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE4_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE4_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE4_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE4_DEFAULT        (_LESENSE_IDLECONF_CHIDLE4_DEFAULT << 8) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE4_DISABLE        (_LESENSE_IDLECONF_CHIDLE4_DISABLE << 8) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE4_HIGH           (_LESENSE_IDLECONF_CHIDLE4_HIGH << 8)   /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE4_LOW            (_LESENSE_IDLECONF_CHIDLE4_LOW << 8)    /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE4_DAC            (_LESENSE_IDLECONF_CHIDLE4_DAC << 8)    /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE5_SHIFT         10                                      /**< Shift value for LESENSE_CHIDLE5             */
#define _LESENSE_IDLECONF_CHIDLE5_MASK          0xC00UL                                 /**< Bit mask for LESENSE_CHIDLE5                */
#define _LESENSE_IDLECONF_CHIDLE5_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE5_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE5_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE5_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE5_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE5_DEFAULT        (_LESENSE_IDLECONF_CHIDLE5_DEFAULT << 10) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE5_DISABLE        (_LESENSE_IDLECONF_CHIDLE5_DISABLE << 10) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE5_HIGH           (_LESENSE_IDLECONF_CHIDLE5_HIGH << 10)  /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE5_LOW            (_LESENSE_IDLECONF_CHIDLE5_LOW << 10)   /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE5_DAC            (_LESENSE_IDLECONF_CHIDLE5_DAC << 10)   /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE6_SHIFT         12                                      /**< Shift value for LESENSE_CHIDLE6             */
#define _LESENSE_IDLECONF_CHIDLE6_MASK          0x3000UL                                /**< Bit mask for LESENSE_CHIDLE6                */
#define _LESENSE_IDLECONF_CHIDLE6_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE6_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE6_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE6_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE6_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE6_DEFAULT        (_LESENSE_IDLECONF_CHIDLE6_DEFAULT << 12) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE6_DISABLE        (_LESENSE_IDLECONF_CHIDLE6_DISABLE << 12) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE6_HIGH           (_LESENSE_IDLECONF_CHIDLE6_HIGH << 12)  /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE6_LOW            (_LESENSE_IDLECONF_CHIDLE6_LOW << 12)   /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE6_DAC            (_LESENSE_IDLECONF_CHIDLE6_DAC << 12)   /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE7_SHIFT         14                                      /**< Shift value for LESENSE_CHIDLE7             */
#define _LESENSE_IDLECONF_CHIDLE7_MASK          0xC000UL                                /**< Bit mask for LESENSE_CHIDLE7                */
#define _LESENSE_IDLECONF_CHIDLE7_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE7_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE7_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE7_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE7_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE7_DEFAULT        (_LESENSE_IDLECONF_CHIDLE7_DEFAULT << 14) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE7_DISABLE        (_LESENSE_IDLECONF_CHIDLE7_DISABLE << 14) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE7_HIGH           (_LESENSE_IDLECONF_CHIDLE7_HIGH << 14)  /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE7_LOW            (_LESENSE_IDLECONF_CHIDLE7_LOW << 14)   /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE7_DAC            (_LESENSE_IDLECONF_CHIDLE7_DAC << 14)   /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE8_SHIFT         16                                      /**< Shift value for LESENSE_CHIDLE8             */
#define _LESENSE_IDLECONF_CHIDLE8_MASK          0x30000UL                               /**< Bit mask for LESENSE_CHIDLE8                */
#define _LESENSE_IDLECONF_CHIDLE8_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE8_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE8_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE8_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE8_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE8_DEFAULT        (_LESENSE_IDLECONF_CHIDLE8_DEFAULT << 16) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE8_DISABLE        (_LESENSE_IDLECONF_CHIDLE8_DISABLE << 16) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE8_HIGH           (_LESENSE_IDLECONF_CHIDLE8_HIGH << 16)  /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE8_LOW            (_LESENSE_IDLECONF_CHIDLE8_LOW << 16)   /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE8_DAC            (_LESENSE_IDLECONF_CHIDLE8_DAC << 16)   /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE9_SHIFT         18                                      /**< Shift value for LESENSE_CHIDLE9             */
#define _LESENSE_IDLECONF_CHIDLE9_MASK          0xC0000UL                               /**< Bit mask for LESENSE_CHIDLE9                */
#define _LESENSE_IDLECONF_CHIDLE9_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE9_DISABLE       0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE9_HIGH          0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE9_LOW           0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE9_DAC           0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE9_DEFAULT        (_LESENSE_IDLECONF_CHIDLE9_DEFAULT << 18) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE9_DISABLE        (_LESENSE_IDLECONF_CHIDLE9_DISABLE << 18) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE9_HIGH           (_LESENSE_IDLECONF_CHIDLE9_HIGH << 18)  /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE9_LOW            (_LESENSE_IDLECONF_CHIDLE9_LOW << 18)   /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE9_DAC            (_LESENSE_IDLECONF_CHIDLE9_DAC << 18)   /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE10_SHIFT        20                                      /**< Shift value for LESENSE_CHIDLE10            */
#define _LESENSE_IDLECONF_CHIDLE10_MASK         0x300000UL                              /**< Bit mask for LESENSE_CHIDLE10               */
#define _LESENSE_IDLECONF_CHIDLE10_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE10_DISABLE      0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE10_HIGH         0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE10_LOW          0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE10_DAC          0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE10_DEFAULT       (_LESENSE_IDLECONF_CHIDLE10_DEFAULT << 20) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE10_DISABLE       (_LESENSE_IDLECONF_CHIDLE10_DISABLE << 20) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE10_HIGH          (_LESENSE_IDLECONF_CHIDLE10_HIGH << 20) /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE10_LOW           (_LESENSE_IDLECONF_CHIDLE10_LOW << 20)  /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE10_DAC           (_LESENSE_IDLECONF_CHIDLE10_DAC << 20)  /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE11_SHIFT        22                                      /**< Shift value for LESENSE_CHIDLE11            */
#define _LESENSE_IDLECONF_CHIDLE11_MASK         0xC00000UL                              /**< Bit mask for LESENSE_CHIDLE11               */
#define _LESENSE_IDLECONF_CHIDLE11_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE11_DISABLE      0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE11_HIGH         0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE11_LOW          0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE11_DAC          0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE11_DEFAULT       (_LESENSE_IDLECONF_CHIDLE11_DEFAULT << 22) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE11_DISABLE       (_LESENSE_IDLECONF_CHIDLE11_DISABLE << 22) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE11_HIGH          (_LESENSE_IDLECONF_CHIDLE11_HIGH << 22) /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE11_LOW           (_LESENSE_IDLECONF_CHIDLE11_LOW << 22)  /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE11_DAC           (_LESENSE_IDLECONF_CHIDLE11_DAC << 22)  /**< Shifted mode DAC for LESENSE_IDLECONF       */
#define _LESENSE_IDLECONF_CHIDLE12_SHIFT        24                                      /**< Shift value for LESENSE_CHIDLE12            */
#define _LESENSE_IDLECONF_CHIDLE12_MASK         0x3000000UL                             /**< Bit mask for LESENSE_CHIDLE12               */
#define _LESENSE_IDLECONF_CHIDLE12_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE12_DISABLE      0x00000000UL                            /**< Mode DISABLE for LESENSE_IDLECONF           */
#define _LESENSE_IDLECONF_CHIDLE12_HIGH         0x00000001UL                            /**< Mode HIGH for LESENSE_IDLECONF              */
#define _LESENSE_IDLECONF_CHIDLE12_LOW          0x00000002UL                            /**< Mode LOW for LESENSE_IDLECONF               */
#define _LESENSE_IDLECONF_CHIDLE12_DAC          0x00000003UL                            /**< Mode DAC for LESENSE_IDLECONF               */
#define LESENSE_IDLECONF_CHIDLE12_DEFAULT       (_LESENSE_IDLECONF_CHIDLE12_DEFAULT << 24) /**< Shifted mode DEFAULT for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE12_DISABLE       (_LESENSE_IDLECONF_CHIDLE12_DISABLE << 24) /**< Shifted mode DISABLE for LESENSE_IDLECONF   */
#define LESENSE_IDLECONF_CHIDLE12_HIGH          (_LESENSE_IDLECONF_CHIDLE12_HIGH << 24) /**< Shifted mode HIGH for LESENSE_IDLECONF      */
#define LESENSE_IDLECONF_CHIDLE12_LOW           (_LESENSE_IDLECONF_CHIDLE12_LOW << 24)  /**< Shifted mode LOW for LESENSE_IDLECONF       */
#define LESENSE_IDLECONF_CHIDLE12_DAC           (_LESENSE_IDLECONF_CHIDLE12_DAC << 24)  /**< Shifted mode DAC for LESENSE_IDLECONF       */
